WELCOME = "سلام! به ربات عنکبوت خوش اومدین. اینجا راه حل درگیری با فیلتراس"
WAIT_AFTER_BUTTON_CLICK = "لطفا صبر کنید ⏲️"
WAIT_FOR_APPROVE = "لطفا تا زمان تایید پرداخت شما توسط ادمین منتظر بمانید. اطلاعات vpn شما بعد از تایید ارسال خواهد شد"
SELECT_PLAN = "💬 پلن مورد نظر خود را انتخاب کنید ..."
MY_ACCOUNT_ORDERS = "اشتراک های خریداری شده شما:"
NO_VALID_PAYMENT_GATEWAY = "امکان انتخاب این روش پرداخب برای پلن مورد نظر وجود ندارد ❌\n\nبرای شروع دوباره /start را وارد کنید"
DUPLICATE_TEST_ACCOUNT = "برای این حساب یک اکانت تست ثبت شده است. می‌توانید از قسمت خرید پلن، یک اشتراک دیگر خریداری کنید"
COMPLETE_ORDER_HEAD_TEXT = ".اتصال عنکبوت شما ایجاد شد"

# edit messages in button click callback
EDIT_SELECT_PLAN_MESSAGE = "شما پلن *{}* را انتخاب کردید."
