WELCOME = "🕸️ سلام! به ربات عنکبوت خوش اومدین. اینجا راه‌حل مشکلات فیلترینگ شماست! 🕸️"
WAIT_AFTER_BUTTON_CLICK = "لطفا کمی صبر کنید... ⏳"
WAIT_FOR_APPROVE = "⏳ لطفاً تا زمان تأیید پرداخت توسط ادمین منتظر بمانید. اطلاعات VPN شما بعد از تأیید ارسال خواهد شد."
SELECT_PLAN = "💬 لطفاً پلن مورد نظر خود را انتخاب کنید:"
MY_ACCOUNT_ORDERS = "📝 اشتراک‌های خریداری‌شده شما:"
MY_ACCOUNT_ORDERS_NOT_FOUND = "🚫 شما هیچ اشتراک فعالی ندارید. از دکمه زیر می‌توانید اشتراک ۱ روزه رایگان تهیه کنید."
NO_VALID_PAYMENT_GATEWAY = "❌ این روش پرداخت برای پلن مورد نظر در دسترس نیست.\n\nبرای شروع دوباره /start را وارد کنید."
DUPLICATE_TEST_ACCOUNT = "⚠️ برای این حساب یک اکانت تست ثبت شده است. می‌توانید از قسمت خرید پلن، یک اشتراک دیگر خریداری کنید."
COMPLETE_ORDER_HEAD_TEXT = "اتصال شما به عنکبوت ایجاد شد! 🕸️"
GET_ORDER_HEAD_TEXT = "🕸️ جزئیات اتصال عنکبوت *{}*:"
SELECT_GATEWAY = "💳 درگاه پرداخت مورد نظر خود را انتخاب کنید:"
CREATE_ORDER_FACTOR = "💰 شما در حال پرداخت مبلغ {} از طریق درگاه {} هستید."
ORDER_CREATED_WITHOUT_DATA = (
    "✅ سفارش شما تایید و فعال شد! 🕸️ جزئیات سفارش را از بخش اشتراک‌ها مشاهده کنید."
)
EXPIRY_NOTIFICATION_WITH_ZERO_DAY_LEFT = (
    "❗️ اشتراک شما امروز منقضی می‌شود. برای جلوگیری از قطع سرویس، تمدید کنید."
)
EXPIRY_NOTIFICATION = "⏰ اشتراک {} در حال منقضی شدن است! برای تمدید اتصال امن خود، اقدام کنید.\n*{} ساعت تا انقضا* ⏲️\n*حجم باقیمانده: {} مگابایت*"
# edit messages in button click callback
EDIT_SELECT_PLAN_MESSAGE = "📝 شما پلن *{}* را انتخاب کردید."
